Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/N11A.tmx
Source language: en_us
Languages: zh_cn

source: An Abduction
zh_cn: 劫持

source: She carried the Jokari set down through the patch of woodland toward the bottom of the garden.
zh_cn: 简带着全套的“乔卡利”穿过一片树林来到了花园的另一边。

source: Her sister, Frances, dark-skinned and fey, not at all like their mother and not yet old enough for boarding school, had chums around to play with.
zh_cn: 她的妹妹法兰希斯还没有到可以上寄宿学校的年龄，她有着深色的皮肤，喜欢异想天开，一点也不像她母亲。

source: They were supposed to be clearing the drive of rabbit droppings with spoons and plastic bags, for money, but they were all four hunkered in a semicircle under the pine trees, where they had set out tea things for their dolls, a pinecone on each tiny plate, a rabbit dropping in each tiny cup.
zh_cn: 法兰希斯在和朋友们一起玩，她们本该带着铲子和塑料口袋去清除车道上的兔粪，但是她们四个人在一棵松树下盘坐成一个半圈，拿出茶具玩布娃娃喝茶的游戏。她们在每个小盘子里放上一颗松果，在每个小杯子里放进一点兔粪。

source: Jane heard Frances chanting in two alternating voices while the others watched, in thrall to her.
zh_cn: 简听见法兰希斯用两种声音变换着角色说话，其它几个朋友在边上入迷地看着她。

source: “Don’t want it! Don’t want it!” Frances said in her whiny voice.
zh_cn: “不要，不要！”法兰希斯用一种呜咽的声音说。

source: “Eat it up,” her vicious voice replied. “Take your nasty medicine.”
zh_cn: “把它吃了，”她换了另一种恶狠狠的语音回答说，“把你该死的药片吃掉。”

source: Kicking off her flip-flops, she settled resignedly into her game.
zh_cn: 简把人字拖踢掉，专心致志地打起了“乔卡利”。

source: The pock and thud of the Jokari ball on the baked ground soothed her, and she started to care about whether she could break her own record of consecutive hits. (She had passed Robin's record long ago.)
zh_cn: 橡皮球在被阳光烘烤着的地上发出啪啪的声响，这使简的心情放松下来，她开始设法打破自己连续击球的记录（她早已超过了罗宾的记录）。

source: Rapt, she didn't notice her father steering the Rover down the drive, on his way out to pick up the Saturday paper; to save petrol, he liked to roll down with the hand brake off, starting the engine only when he turned into the road.
zh_cn: 她很用心地打球，以至没有注意到她父亲开着罗孚车经过了车道。父亲是去取星期六的报纸，为了节省汽油，他喜欢松开手刹让汽车滑下车道，直到转弯上了马路才发动引擎。

source: Jane scooped low to the ground under an awkward shot, getting it up with too much force just as the sleek black of the car eased into the edge of her vision; the ball on its elastic must have seemed smashed deliberately and vindictively against the car's side window (which luckily was not open).
zh_cn: 为了击打一个位置刁钻的球简把身子弯得很低，她用了很大的力气把球铲了起来，这时黑亮的汽车正好进入她视线的边缘。被弹性绳子牵着的橡皮球看起来好像是有意并且猛力地朝着汽车侧面的车窗打去，还好车窗是关着的。

source: Assaulted amid his reverie, Mr. Allsop was outraged out of all proportion to the offense- nothing was broken.
zh_cn: 艾尔索普先生正在想入非非，不料无端受到了攻击，于是不分青红皂白地大发脾气，尽管什么东西也没有损坏。

source: He stopped the car and half stood up out of it to rant across its roof at Jane: Stupid girl!
zh_cn: 他停下车来，半探出身子越过车顶对着简大声咆哮：蠢姑娘！

source: Didn't she have anything better to do?
zh_cn: 你没有更好的事情可以做了吗？

source: Then the car rolled on, ominously firing to life when it felt the road, and Jane was left wounded, staring after it.
zh_cn: 然后汽车又向下滑动起来，到了路上引擎不怀好意地发动起来，把心情受伤的简抛在后面干瞪眼。

source: The wings of her spirit, which had been beginning to soar, faltered and flung her to earth, because, after all, she had been doing her best, nothing else; and also because her father was supposed to be her ally in the family, though they weren't at all alike.
zh_cn: 她精神的翅膀刚开始飞翔，就摇摇晃晃地掉落到了地上，因为毕竟她已经尽了最大的努力，并且没有做任何坏事，还因为她把父亲当作自己在家里的同盟军，尽管他们两人一点也不像。

source: Mr. Allsop was small and dark, like Frances, easily bored, and clever with figures.
zh_cn: 艾尔索普先生像法兰希斯一样个子不高皮肤黧黑，他很容易生气，还精于数字。

source: He thought about Jane vaguely, through a fog of fond concern, fearing that she had her mother's flat, bland surface without Mrs. Allsop's force of conviction- or whatever it was that kept her impermeable, buoyant.
zh_cn: 他想到简的时候思维有些模糊，尽管也有朦胧的关爱，但他担心她会有她母亲直白而淡漠的表象，却没有她母亲的那种自信，或者那种能使她母亲既活泼开朗又难以渗透的东西。

source: Jane dropped her paddle in an uncharacteristic gesture of despair. Tears stung her eyes; she stood with her hands by her sides, palms outward, in a kind of resigned openness.
zh_cn: 简用一种非同寻常的绝望姿势把球拍丢在地上，眼泪从她眼中夺眶而出。她垂手而立，手掌朝外，摆出一副自暴自弃的姿态。

source: What next, then, if even her attempt at virtue had failed?
zh_cn: 假如她想学好也学不成，接下来她该做些什么呢？
